Revit 2026 API

# PointOnEdge Properties

---

The PointOnEdge type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LocationOnCurve | The point location on curve. |

#### Reference

PointOnEdge Class

Autodesk.Revit.DB Namespace